t5/app/models/concerns/authorize_request.rb

SELECT "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
  def authorize_request
    header = request.headers['Authorization']
    header = header.split(' ').last if header
    if header.nil?
      render json: { errors: 'Unauthorized access' }, status: :unauthorized and return
    end

    begin
      @decoded = JsonWebToken.decode(header)
      @current_trainer = Trainer.find(@decoded[:trainer_id])