t5/app/models/battle.rb

  def self.with_pokemons
    Battle.includes(pokemon_battle: :pokemon).all.as_json(include: { pokemon_battle: { include: :pokemon } })
---
SELECT "battles".* FROM "battles"
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 3]]