t5/app/models/pokemon.rb

  def self.pokemons_by_trainer
    Trainer.includes(:pokemon).all.as_json(include: :pokemon)
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "trainers".* FROM "trainers"