t5/app/controllers/api/v1/authentication_controller.rb

SELECT "trainers".* FROM "trainers" WHERE "trainers"."username" = ? LIMIT ?  [["username", "trainer1"], ["LIMIT", 1]]
---
  def login
    @trainer = Trainer.find_by(username: params[:username])