t5/app/controllers/api/v1/battles_controller.rb

UPDATE "battles" SET "location" = ?, "updated_at" = ? WHERE "battles"."id" = ?  [["location", "tal city"], ["updated_at", "2024-08-08 16:24:03.163484"], ["id", 1]]
---
  def update
    if @battle.update(battle_params)

DELETE FROM "battles" WHERE "battles"."id" = ?  [["id", 2]]
---
  def destroy
    @battle.destroy

SELECT "battles".* FROM "battles" WHERE "battles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_battle
      @battle = Battle.find(params[:id])