t5/app/controllers/api/v1/pokemon_battles_controller.rb

INSERT INTO "pokemon_battles" ("pokemon_id", "battle_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["pokemon_id", 6], ["battle_id", 1], ["created_at", "2024-08-08 16:47:12.591287"], ["updated_at", "2024-08-08 16:47:12.591287"]]
---
  def create
    @pokemon_battle = PokemonBattle.new(pokemon_battle_params)

    if @pokemon_battle.save

DELETE FROM "pokemon_battles" WHERE "pokemon_battles"."id" = ?  [["id", 4]]
---
  def destroy
    @pokemon_battle.destroy

SELECT "battles".* FROM "battles" WHERE "battles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "pokemon_battles".* FROM "pokemon_battles" WHERE "pokemon_battles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_pokemon_battle
      @pokemon_battle = PokemonBattle.find(params[:id])