t5/app/controllers/api/v1/pokemons_controller.rb

  def create
    @pokemon = Pokemon.new(pokemon_params)

    if @pokemon.save
---
INSERT INTO "pokemons" ("name", "poke_type", "level", "trainer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "teste"], ["poke_type", "fire"], ["level", 1], ["trainer_id", 1], ["created_at", "2024-08-08 15:33:38.635799"], ["updated_at", "2024-08-08 15:33:38.635799"]]

  def update
    if @pokemon.update(pokemon_params)
---
UPDATE "pokemons" SET "poke_type" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["poke_type", "asldmas"], ["updated_at", "2024-08-08 15:36:42.620730"], ["id", 12]]

  def destroy
    @pokemon.destroy
---
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 2]]

    def set_pokemon
      @pokemon = Pokemon.find(params[:id])
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]