t5/app/controllers/api/v1/trainers_controller.rb

  def index
    @trainers = Trainer.order(created_at: :desc)
---
SELECT "trainers".* FROM "trainers" ORDER BY "trainers"."created_at" DESC

  def create
    @trainer = Trainer.new(trainer_params)

    if @trainer.save
---
INSERT INTO "trainers" ("name", "age", "username", "password_digest", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "user"], ["age", 10], ["username", "user"], ["password_digest", "[FILTERED]"], ["created_at", "2024-08-08 04:34:21.385347"], ["updated_at", "2024-08-08 04:34:21.385347"], ["role", "user"]]

  def update
    if @trainer.update(trainer_params)
---
UPDATE "trainers" SET "name" = ?, "age" = ?, "password_digest" = ?, "updated_at" = ? WHERE "trainers"."id" = ?  [["name", "another cool name"], ["age", 10], ["password_digest", "[FILTERED]"], ["updated_at", "2024-08-08 13:00:02.139924"], ["id", 30]]

  def destroy
    @trainer.destroy
---
DELETE FROM "trainers" WHERE "trainers"."id" = ?  [["id", 28]]

    def set_trainer
      @trainer = Trainer.find(params[:id])
---
SELECT "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]