t5/app/controllers/api/v1/trainer_profiles_controller.rb

SELECT "trainer_profiles".* FROM "trainer_profiles"
---
  def index
    @trainer_profiles = TrainerProfile.all

SELECT "trainer_profiles".* FROM "trainer_profiles" WHERE "trainer_profiles"."trainer_id" = ? LIMIT ?  [["trainer_id", 13], ["LIMIT", 1]]
---
  def show_by_trainer
    @trainer_profile = TrainerProfile.find_by(trainer_id: @current_trainer.id)

INSERT INTO "trainer_profiles" ("hometown", "favorite_pokemon", "trainer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["hometown", "teste"], ["favorite_pokemon", "aaa"], ["trainer_id", 17], ["created_at", "2024-08-08 14:24:33.067337"], ["updated_at", "2024-08-08 14:24:33.067337"]]
---
  def create
    @trainer_profile = TrainerProfile.new(trainer_profile_params)

    if @trainer_profile.save

UPDATE "trainer_profiles" SET "hometown" = ?, "favorite_pokemon" = ?, "updated_at" = ? WHERE "trainer_profiles"."id" = ?  [["hometown", "novo"], ["favorite_pokemon", "aaaaaaa"], ["updated_at", "2024-08-08 14:49:44.569784"], ["id", 17]]
---
  def update
    if @trainer_profile.update(trainer_profile_params)

DELETE FROM "trainer_profiles" WHERE "trainer_profiles"."id" = ?  [["id", 6]]
---
  def destroy
    @trainer_profile.destroy

SELECT "trainer_profiles".* FROM "trainer_profiles" WHERE "trainer_profiles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def set_trainer_profile
      @trainer_profile = TrainerProfile.find(params[:id])